firstMember = float(input('перший член прогресії (число): ')  )                 #введення першого члену прогресії та переведення строки у число із плаваючою точкою
difference = float(input('різниця прогресії (число): ')  )                      #введення різниці прогресії та переведення строки у число із плаваючою точкою
number = int(input('номер шуканого числа (ціле число, більше за нуль): '))      #введення номеру шуканого члена та переведення строки у ціле число

result = firstMember + difference * (number - 1)                                #обчислення шуканого члену прогресії
print('шукане:', result)